tutorials/multiphase/cavitatingFoam/ras/throttle/constant/thermodynamicProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermodynamicProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

barotropicCompressibilityModel    linear; //Chung;

psiv                              psiv       [0 -2 2 0 0]     2.5e-06;

rholSat                           rholSat    [1 -3 0 0 0]     830;

psil                              psil       [0 -2 2 0 0]     5e-07;

pSat                              pSat       [1 -1 -2 0 0]    4500;

rhoMin                           rhoMin     [1 -3 0 0 0]     0.001;

// ************************************************************************* //
